# ExternallyTaggedNonBReps Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedNonBReps Methods
ExternallyTaggedNonBReps Class See Also
---
The ExternallyTaggedNonBReps type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Add | Adds a copy of the input ExternallyTaggedNonBRep to this collection. |
| CanAddExternallyTaggedNonBRep | Checks if the input geometry could be added to this collection or not. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace